# DS 2002: Midterm Project Report
Eric Nguyen - wvu9cs

Professor Jon Tupitza

Due: March 22nd, 2023

# Prerequisites:
### MySQL Imports:
#### Import the Necessary Libraries

In [1]:
# Import any necessary libraries (MySQL)
import os
import numpy
import pandas as pd
from sqlalchemy import create_engine

# Import any necessary libaries (MongoDB)
import json
import datetime
import pymongo

#### Declare & Assign Connection Variables

In [2]:
# Assign variables for MySQL Server & Databases
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

src_dbname = "sakila"
dst_dbname = "sakila_dw"

# Assign Variables for Mongo DB Server and Databases
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
mysql_host = "ds2002-mysql.mysql.database.azure.com"

atlas_cluster_name = "ds2002.wysflex"
atlas_user_name = "wvu9cs"
atlas_password = "DataScience"

conn_mongo_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila"
dst_dbname = "sakila_dw"

print(f"Local Connection String: {conn_mongo_str['local']}")
print(f"Atlas Connection String: {conn_mongo_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://wvu9cs:DataScience@ds2002.wysflex.mongodb.net

#### Define Functions for Getting Data From and Setting Data Into Databases

In [3]:
# The following functions are referenced for the MySQL databases
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_sql_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_sql_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_sql_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_sql_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()
    
# The following functions are referenced for the Mongo DB databases
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_mongo_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_mongo_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe2(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_mongo_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_mongo_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Create the New Data Warehouse database, and to Use it, Switch the Connection Context

In [4]:
# Creating the connection string
conn_sql_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_sql_str, pool_recycle=3600)

# Executing SQL statements to create sakila_dw
sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

#### Populate MongoDB with Source Data

In [5]:
client = pymongo.MongoClient(conn_mongo_str["atlas"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {
              "customers" : 'sakila_customer.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

# 1.0. Create & Populate the Dimension Tables
#### 1.1. Extract Data from the Source Database Tables
Here, the rental and date dimension table by querying directly from MySQL, the customer dimension table is created querying MongoDB, and the store dimension table is created by reading data from my file system in the CSV format. This satisfies the 3 data originating sources requirement.

In [6]:
# Querying directly from MySQL
sql_rentals = "SELECT * FROM sakila.rental;"
df_rentals = get_dataframe(user_id, pwd, host_name, src_dbname, sql_rentals)
df_rentals.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [7]:
# Querying MongoDB
query = {}
collection = "customers"

df_customers = get_mongo_dataframe(conn_mongo_str['atlas'], src_dbname, collection, query)
df_customers.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [8]:
# Reading Data from File System (CSV)
df_staff = pd.read_csv("sakila_store.csv")
df_staff.head(2)

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,NaN,Jon.Stephens@sakilastaff.com,2,1,Jon,NaN,2006-02-15 03:57:16

In [9]:
# Querying directly from MySQL
sql_dates = "SELECT * FROM sakila_dw.dim_date;"
df_dates = get_dataframe(user_id, pwd, host_name, src_dbname, sql_dates)
df_dates.head(2)

,date_key,full_date,date_name,date_name_us,date_name_eu,day_of_week,day_name_of_week,day_of_month,day_of_year,weekday_weekend,...,is_last_day_of_month,calendar_quarter,calendar_year,calendar_year_month,calendar_year_qtr,fiscal_month_of_year,fiscal_quarter,fiscal_year,fiscal_year_month,fiscal_year_qtr
0,20000101,2000-01-01,2000/01/01,01/01/2000,01/01/2000,7,Saturday,1,1,Weekend,...,N,1,2000,2000-01,2000Q1,7,3,2000,2000-07,2000Q3
1,20000102,2000-01-02,2000/01/02,01/02/2000,02/01/2000,1,Sunday,2,2,Weekend,...,N,1,2000,2000-01,2000Q1,7,3,2000,2000-07,2000Q3

#### 1.2. Perform Any Necessary Transformations
Here, I perform edits to the rentals, customers, and dates dataframes previously created. For each, I create/edit a list of columns which will be used to drop the columns in each respective dataframe. Once dropped, select variables are renamed for clarity and convention and the first two entries are displayed.

In [10]:
drop_cols = ['last_update'] # Dropped because it is not relevant to the fact table
df_rentals.drop(drop_cols, axis=1, inplace=True)
df_rentals.rename(columns={"rental_id":"rental_key","customer_id":"customer_key","inventory_id":"inventory_key","staff_id":"staff_key"}, inplace=True)

# Remove the time from the data. We only want the date, so that it can be merged later on.
df_rentals['rental_date'] = pd.to_datetime(df_rentals['rental_date']).dt.date
df_rentals['return_date'] = pd.to_datetime(df_rentals['return_date']).dt.date

df_rentals.head(2)

   rental_key rental_date  inventory_key  customer_key return_date  staff_key
0           1  2005-05-24            367           130  2005-05-26          1
1           2  2005-05-24           1525           459  2005-05-28          1

In [11]:
drop_cols = ['create_date', 'last_update', 'store_id','address_id'] # Dropped because it has no functionality without the other dimension tables
df_customers.drop(drop_cols, axis=1, inplace=True)
df_customers.rename(columns={"customer_id":"customer_key",}, inplace=True)

df_customers.head(2)

,customer_key,first_name,last_name,email,active
0,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,1
1,2,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,1

In [12]:
drop_cols = ['username', 'last_update', 'password','picture','store_id','address_id'] # Dropped because not relevant and not functional
df_staff.drop(drop_cols, axis=1, inplace=True)
df_staff.rename(columns={"staff_id":"staff_key",}, inplace=True)

df_staff.head(2)

   staff_key first_name last_name                         email  active
0          1       Mike   Hillyer  Mike.Hillyer@sakilastaff.com       1
1          2        Jon  Stephens  Jon.Stephens@sakilastaff.com       1

In [13]:
drop_cols = ['date_name', 'date_name_us', 'date_name_eu', 'day_of_week', 'day_name_of_week', 'day_of_month', 'day_of_year', 'weekday_weekend',
            'is_last_day_of_month', 'calendar_quarter', 'calendar_year', 'calendar_year_month', 'calendar_year_qtr', 'fiscal_month_of_year',
            'fiscal_quarter', 'fiscal_year_month', 'fiscal_year_qtr', 'week_of_year', 'month_name', 'month_of_year', 'fiscal_year']
df_dates.drop(drop_cols, axis=1, inplace=True)
df_dates = df_dates.rename(columns={"date_key" : "rental_date_key", "full_date" : "rental_date"})
#df_dates['rental_date'] = pd.to_datetime(df_dates['rental_date']).dt.date

df_dates.head(2)

   rental_date_key rental_date
0         20000101  2000-01-01
1         20000102  2000-01-02

#### 1.3. Load the Transformed DataFrames into the New Data Warehouse by Creating New Tables
Here, the db_operation is defined as insert, and tables are put into tuples in order to be inserted into the data warehouse. The for loop then traverses the table and inserts the tables accordingly.

In [14]:
# Initialize variables for set_dateframe() beow
db_operation = "insert"

tables = [('dim_rentals', df_rentals, 'rental_key'),
          ('dim_customers', df_customers, 'customer_key'),
          ('dim_staff', df_staff, 'staff_key'),
          ('dim_dates', df_dates, 'rental_date_key')]

In [15]:
# Python Code to set dataframe
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

# 2.0. Create & Populate the Fact Table
#### 2.1 Create the Fact Table
First, the fact table is merged between the rentals and customers dataframe on the customer_key column. Then, it is merged again with the dates dataframe. The columns are then reordered for clarity and convention. Finally, the transaction_key column is added and the first 15 entries are displayed.

In [16]:
# Merge the dimension tables to create the fact table
df_fact_rentals = pd.merge(df_rentals, df_customers, on='customer_key', how='left')
df_fact_rentals = pd.merge(df_fact_rentals, df_staff, on='staff_key', how='left')
df_fact_rentals = pd.merge(df_fact_rentals, df_dates, on='rental_date', how='left')

# Insert a new column, with an ever-incrementing numeric value, to serve as the primary key.
df_fact_rentals.insert(0, "transaction_key", range(1, df_fact_rentals.shape[0]+1))

# Display Table
df_fact_rentals.head(5)

,transaction_key,rental_key,rental_date,inventory_key,customer_key,return_date,staff_key,first_name_x,last_name_x,email_x,active_x,first_name_y,last_name_y,email_y,active_y,rental_date_key
0,1,1,2005-05-24,367,130,2005-05-26,1,CHARLOTTE,HUNTER,CHARLOTTE.HUNTER@sakilacustomer.org,1,Mike,Hillyer,Mike.Hillyer@sakilastaff.com,1,20050524
1,2,2,2005-05-24,1525,459,2005-05-28,1,TOMMY,COLLAZO,TOMMY.COLLAZO@sakilacustomer.org,1,Mike,Hillyer,Mike.Hillyer@sakilastaff.com,1,20050524
2,3,3,2005-05-24,1711,408,2005-06-01,1,MANUEL,MURRELL,MANUEL.MURRELL@sakilacustomer.org,1,Mike,Hillyer,Mike.Hillyer@sakilastaff.com,1,20050524
3,4,4,2005-05-24,2452,333,2005-06-03,2,ANDREW,PURDY,ANDREW.PURDY@sakilacustomer.org,1,Jon,Stephens,Jon.Stephens@sakilastaff.com,1,20050524
4,5,5,2005-05-24,2079,222,2005-06-02,1,DELORES,HANSEN,DELORES.HANSEN@sakilacustomer.org,1,Mike,Hillyer,Mike.Hillyer@sakilastaff.com,1,20050524

#### 2.2 Perform Necessary Transformations on the Fact Table
The Fact Table below contains only the relevant keys to the dimension tables, and the return date that is associated with each rental.

In [17]:
# Drop Columns
df_fact_rentals.drop(['rental_date', 'first_name_x', 'last_name_x', 'email_x', 'active_x', 'first_name_y', 'last_name_y', 'email_y', 'active_y'], axis=1, inplace=True)

# Reorder the columns
ordered_columns = ['transaction_key', 'rental_key', 'customer_key','rental_date_key', 'staff_key', 'return_date']
df_fact_rentals = df_fact_rentals[ordered_columns]

# Display Table
df_fact_rentals.head(5)

,transaction_key,rental_key,customer_key,rental_date_key,staff_key,return_date
0,1,1,130,20050524,1,2005-05-26
1,2,2,459,20050524,1,2005-05-28
2,3,3,408,20050524,1,2005-06-01
3,4,4,333,20050524,2,2005-06-03
4,5,5,222,20050524,1,2005-06-02

#### 2.3. Write the DataFrame Back to the Database
Here, the set_dateframe() function is leveraged in order to write the fact table to the data warehouse.

In [18]:
# Initialize variables to set dataframe
table_name = "fact_rentals"
primary_key = "rental_key"
db_operation = "insert"

set_dataframe(user_id, pwd, host_name, dst_dbname, df_fact_rentals, table_name, primary_key, db_operation)

# 3.0. Demonstrate that the New Data Warehouse Exists and Contains the Correct Data
Here, three SQL statements are written, each coming from a different source: fact_transactions, dim_rentals, and dim_customers. Their respective charts are then displayed. Please see the comments included for summaries on what the charts display.

In [19]:
# Create the SQL Test statement - Records all of the customers who made a rental with staff member 1. This does not utilize aggregation (Sum, Count, Avg, etc.)
sql_test = """
SELECT 
    c.customer_key, 
    c.first_name, 
    c.last_name, 
    c.email, 
    c.active,
    s.staff_key
FROM 
    `{0}`.`dim_customers` AS c 
    JOIN `{0}`.`dim_rentals` AS r ON c.customer_key = r.customer_key 
    JOIN `{0}`.`dim_staff` AS s ON r.staff_key = s.staff_key 
WHERE 
    s.staff_key = 1;

""".format(dst_dbname)

# Get the dataframe
df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)

# Test the SQL Statement and Test Dataframe
df_test.head()

,customer_key,first_name,last_name,email,active,staff_key
0,130,CHARLOTTE,HUNTER,CHARLOTTE.HUNTER@sakilacustomer.org,1,1
1,459,TOMMY,COLLAZO,TOMMY.COLLAZO@sakilacustomer.org,1,1
2,408,MANUEL,MURRELL,MANUEL.MURRELL@sakilacustomer.org,1,1
3,222,DELORES,HANSEN,DELORES.HANSEN@sakilacustomer.org,1,1
4,549,NELSON,CHRISTENSON,NELSON.CHRISTENSON@sakilacustomer.org,1,1

In [20]:
# Create the SQL Test statement - Records the number rentals made per staff member.
sql_test = """
SELECT 
    staff_key, COUNT(*) AS num_rentals
FROM 
    `{0}`.`fact_rentals`
GROUP BY 
    staff_key;
""".format(dst_dbname)
df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)

# Test the SQL Statement and Test Dataframe
df_test.head()

   staff_key  num_rentals
0          1         8040
1          2         8004

In [21]:
# Create the SQL Test statement - Records the number of active customers.
sql_test = """SELECT COUNT(*) AS num_active_customers FROM `{0}`.`dim_customers` WHERE active = 1;""".format(dst_dbname)
df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)

# Test the SQL Statement and Test Dataframe
df_test.head()

   num_active_customers
0                   584

In [22]:
# Create the SQL Test statement - Records the number of active staff members.
sql_test = """SELECT COUNT(*) AS num_active_staff FROM `{0}`.`dim_staff` WHERE active = 1;""".format(dst_dbname)
df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)

# Test the SQL Statement and Test Dataframe
df_test.head(5)

   num_active_staff
0                 2

#### 3.1. Display the Dataframes From The Data Warehouse

In [23]:
# Select the first 5 entries of fact_rentals from the data warehouse
sql_test = """SELECT * FROM `{0}`.`fact_rentals`""".format(dst_dbname)
df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)
df_test.head(5)

,transaction_key,rental_key,customer_key,rental_date_key,staff_key,return_date
0,1,1,130,20050524,1,2005-05-26
1,2,2,459,20050524,1,2005-05-28
2,3,3,408,20050524,1,2005-06-01
3,4,4,333,20050524,2,2005-06-03
4,5,5,222,20050524,1,2005-06-02

In [24]:
# Select the first 5 entries of dim_customers from the data warehouse
sql_test = """SELECT * FROM `{0}`.`dim_customers`""".format(dst_dbname)
df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)
df_test.head(5)

,customer_key,first_name,last_name,email,active
0,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,1
1,2,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,1
2,3,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,1
3,4,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,1
4,5,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,1

In [25]:
# Select the first 5 entries of dim_staff from the data warehouse
sql_test = """SELECT * FROM `{0}`.`dim_staff`""".format(dst_dbname)
df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)
df_test.head(5)

   staff_key first_name last_name                         email  active
0          1       Mike   Hillyer  Mike.Hillyer@sakilastaff.com       1
1          2        Jon  Stephens  Jon.Stephens@sakilastaff.com       1

In [26]:
# Select the first 5 entries of dim_dates from the data warehouse
sql_test = """SELECT * FROM `{0}`.`dim_dates`""".format(dst_dbname)
df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)
df_test.head(5)

   rental_date_key rental_date
0         20000101  2000-01-01
1         20000102  2000-01-02
2         20000103  2000-01-03
3         20000104  2000-01-04
4         20000105  2000-01-05